<template>
    <modal-layout :pageTitle="props.title" v-if="props.title === '用户协议'">
        <div class="agreement_content">
            <div class="agreement_texts">
                尊敬的用户，欢迎使用由广东丰德科技有限公司（下列简称为“丰德”）提供的服务。在使用前请您阅读如下服务协议，使用本应用即表示您同意接受本协议，本协议产生法律效力，特别涉及免除或者限制丰德责任的条款，请仔细阅读。如有任何问题，可向丰德咨询。
            </div>

            <div class="agreement_title">一、服务条款的确认和接受</div>
            <div class="agreement_texts">通过访问或使用本应用，表示用户同意接受本协议的所有条件和条款。</div>

            <div class="agreement_title">二、服务条款的变更和修改</div>
            <div class="agreement_texts">
                丰德有权在必要时修改服务条款，服务条款一旦发生变更，将会在重要页面上提示修改内容。如果不同意所改动的内容，用户可以放弃获得的本应用信息服务。如果用户继续享用本应用的信息服务，则视为接受服务条款的变更。本应用保留随时修改或中断服务而不需要通知用户的权利。本应用行使修改或中断服务的权利，不需对用户或第三方负责。
            </div>

            <div class="agreement_title">三、关于本服务</div>
            <div class="agreement_texts">
                <ol>
                    <li>本服务内容是指技术开发方通过本应用程序向其合作伙伴及用户提供的相关服务（简称“本服务”）。</li>
                    <li>对用户使用的本服务，技术开发方会不断丰富用户使用本服务的终端、形式等。</li>
                    <li>
                        许可的范围： （1）技术开发方授予用户一项个人的、不可转让及非排他性的许可，以使用本应用程序。
                        （2）本条及本协议其他条款未明示授权的其他一切知识产权权利仍由技术开发方保留。技术开发方如果未行使前述任何权利，并不构成对该权利的放弃。
                    </li>
                </ol>
            </div>

            <div class="agreement_title">四、账号登录</div>
            <div class="agreement_texts">
                为使用本应用程序用户可能需要输入个人信息进行登录与使用。
                用户清楚知晓，其向技术开发方提供的账户仅限本人使用，否则，用户可能会对用户或他人造成侵权。用户承诺并同意，使用同一设备、同一身份证号或账号使用本协议项下服务的，均视为用户本人的行为。用户应妥善保管自身设备、身份证件及账号密码信息，审慎交由他人使用或使用他人设备、身份证件或账户信息，如用户违反本约定给用户或他人造成损失的，技术开发方不应也不会承担任何法律责任。用户若因此给技术开发方造成损失的，应承担技术开发方所遭受的全部损失。
            </div>

            <div class="agreement_title">五、应用程序的使用</div>
            <div class="agreement_texts">
                为使用本应用程序用户可能需要输入个人信息进行登录与使用。
                如果用户从非技术开发方合作伙伴的应用程序或非技术开发方合作伙伴处获取本应用程序或与本应用程序名称相同的安装程序，技术开发方无法保证该应用程序能够正常使用，并对因此给用户造成的损失不予负责。
            </div>

            <div class="agreement_title">六、应用程序的更新</div>
            <div class="agreement_texts">
                <ol>
                    <li>
                        为了增进用户体验、完善服务内容，技术开发方将不断努力为用户时时提供应用程序更新（这些更新可能会采取应用程序替换、修改、功能强化、版本升级等形式）。
                    </li>
                    <li>
                        为了改善用户体验，并保证服务的安全性和功能的一致性，技术开发方有权不经向用户特别通知而对应用程序进行更新，或者对应用程序的部分功能效果进行改变或限制。
                    </li>
                </ol>
            </div>

            <div class="agreement_title">七、用户个人信息保护</div>
            <div class="agreement_texts">
                <ul>
                    <li>
                        保护用户个人信息是技术开发方的一项基本原则，技术开发方将会采取合理的措施保护用户的个人信息。除法律法规规定及用户授权的情形外，未经用户许可技术开发方不会向任何第三方公开、透露用户个人信息。
                    </li>
                    <li>
                        用户在登录账号或使用本服务的过程中，可能需要填写一些必要的信息。若用户填写的信息不真实或不完整，则可能无法正常使用本服务。
                    </li>
                    <li>
                        一般情况下，用户可随时浏览、修改自己提交的信息，但出于安全性和身份识别的考虑，用户可能无法修改注册时提供的初始注册信息及其他验证信息。
                    </li>
                    <li>
                        技术开发方将运用各种安全技术和程序建立完善的管理制度来保护用户的个人信息，以免遭受未经授权的访问、使用或披露。
                    </li>
                </ul>
            </div>

            <div class="agreement_title">八、知识产权声明</div>
            <div class="agreement_texts">
                <ol>
                    <li>
                        技术开发方是本应用程序的知识产权权利人。本应用程序的著作权、商标权、专利权、商业秘密等知识产权，以及与本应用程序相关的所有信息内容（包括但不限于文字、图片、音频、视频、图表、界面设计、版面框架、有关数据或电子文档等）均受中华人民共和国法律法规和相应的国际条约保护，技术开发方依法享有上述相关知识产权，但相关权利人依照法律规定应享有的权利除外。
                    </li>
                    <li>
                        未经技术开发方或相关权利人书面同意，用户不得为任何商业或非商业目的自行或许可任何第三方实施、利用、转让上述知识产权。
                    </li>
                </ol>
            </div>

            <div class="agreement_title">九、不可抗力及合理免责</div>
            <div class="agreement_texts">
                “不可抗力”是指在本协议签订后发生的、受影响一方无法预见、无法避免并无法克服的客观情况。此等事件包括但不限于水灾、火灾、旱灾、台风、地震及其它自然灾害、罢工、骚动、暴乱及战争以及政府部门的作为或不作为、法律法规或政策调整、数据来源变更(包括但不限于其服务内容及形式的变更)、国内数据渠道瘫痪、黑客攻击、计算机病毒侵入、新型病毒爆发、因电信运营商问题导致网络中断服务器不可访问、停电、系统故障、传输线路、通信故障等技术开发方无法控制的因素。因受不可抗力影响而不能履行或不能完全履行本协议的不视为违约，不应承担相应违约责任
                。
            </div>
        </div>
    </modal-layout>
    <modal-layout :pageTitle="props.title" v-else>
        <div class="privacy_content">
            <div class="privacy_texts">
                本应用尊重并保护所有使用服务用户的个人隐私权。为了给您提供更准确、更有个性化的服务，本应用会按照本隐私权政策的规定使用和披露您的个人信息。但本应用将以高度的勤勉、审慎义务对待这些信息。除本隐私权政策另有规定外，在未征得您事先许可的情况下，本应用不会将这些信息对外披露或向第三方提供。本应用会不时更新本隐私权政策。
                您在同意本应用服务使用协议之时，即视为您已经同意本隐私权政策全部内容。本隐私权政策属于本应用服务使用协议不可分割的一部分。
            </div>

            <div class="privacy_title">一、我们所收集的信息以及如何使用：</div>
            <div class="privacy_texts">
                我们可能通过您的IP地址，地理位置信息，收集一些非个人隐私的统计资料，使我们能够进一步改善APP的服务。例如，当您浏览一个网页时，此网址、当时的时间、您所使用的浏览器性质、给您提供接入服务的ISP等，可能都会被自动记录下来。
            </div>

            <div class="privacy_title">二、信息公开与共享</div>
            <div class="privacy_texts">
                APP不会将您的个人资料提供给任何人。但以下情况除外：
                <ol>
                    <li>已获得用户的明确授权</li>
                    <li>根据有关法律法规的要求或按照法院或相关政府部门的要求；</li>
                    <li>为维护APP的合法权益；</li>
                    <li>为维护APP的用户和社会公众的合法权益；</li>
                    <li>APP认为有必要的其他情况。</li>
                </ol>
            </div>

            <div class="privacy_title">三、信息的更新和删除</div>
            <div class="privacy_texts">
                在您的个人资料有变动的情况下，您可以更新和修改您的个人资料已使其有效。您在任何时候都能非常容易地使用您的注册名与密码登录本网站以修改或删除您的个人资料及档案。
            </div>

            <div class="privacy_title">四、保护您的隐私</div>
            <div class="privacy_texts">
                我们将采取严格的措施保护您的隐私，确保您的隐私权不受任何侵犯。只要您提供给我们任何个人信息，我们都会采取有效的手段保护您的信息（法律或政府的强制性规定不在此限）。
            </div>

            <div class="privacy_title">五、更新隐私条款</div>
            <div class="privacy_texts">
                我们可能会对APP的隐私权政策进行修改，如果在使用用户个人信息政策方面有大幅度修改时，我们会通过您的联系方式通知您。
            </div>
        </div>
    </modal-layout>
</template>

<script lang="ts" setup>
import ModalLayout from "@/components/Layout/ModalLayout.vue"

const props = withDefaults(defineProps<{ title: string }>(), {
    title: "标题",
})
</script>

<style scoped lang="scss">
.agreement_content,
.privacy_content {
    padding: 2rem;
    font-size: 1rem;
}
.agreement_title,
.privacy_title {
    font-weight: bold;
    font-size: 1.8rem;
    margin: 1rem 0rem;
}
.agreement_texts,
.privacy_texts {
    font-size: 1.5rem;
}
</style>
